results/mongodb/workloada_load.log
java -cp /local/build/ycsb/mongodb-binding/conf:/local/build/ycsb/conf:/local/build/ycsb/lib/core-0.17.0.jar:/local/build/ycsb/lib/HdrHistogram-2.1.4.jar:/local/build/ycsb/lib/jackson-mapper-asl-1.9.4.jar:/local/build/ycsb/lib/htrace-core4-4.1.0-incubating.jar:/local/build/ycsb/lib/jackson-core-asl-1.9.4.jar:/local/build/ycsb/mongodb-binding/lib/snappy-java-1.1.7.1.jar:/local/build/ycsb/mongodb-binding/lib/logback-classic-1.1.2.jar:/local/build/ycsb/mongodb-binding/lib/mongo-java-driver-3.8.0.jar:/local/build/ycsb/mongodb-binding/lib/slf4j-api-1.7.25.jar:/local/build/ycsb/mongodb-binding/lib/mongodb-binding-0.17.0.jar:/local/build/ycsb/mongodb-binding/lib/logback-core-1.1.2.jar:/local/build/ycsb/mongodb-binding/lib/mongodb-async-driver-2.0.1.jar site.ycsb.Client -db site.ycsb.db.MongoDbClient -s -P /local/build/ycsb/workloads/workloada -p recordcount=1000000 -p operationcount=500000 -p mongodb.url=mongodb://127.0.0.1:27099/ycsb -threads 8 -load
Command line: -db site.ycsb.db.MongoDbClient -s -P /local/build/ycsb/workloads/workloada -p recordcount=1000000 -p operationcount=500000 -p mongodb.url=mongodb://127.0.0.1:27099/ycsb -threads 8 -load
YCSB Client 0.17.0

Loading workload...
Starting test.
2026-05-02 18:28:14:478 0 sec: 0 operations; est completion in 0 second 
mongo client connection created with mongodb://127.0.0.1:27099/ycsb
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
[...]
2026-05-02 18:28:24:444 10 sec: 458289 operations; 45828.9 current ops/sec; est completion in 12 seconds [INSERT: Count=458384, Max=123007, Min=52, Avg=166.5, 90=182, 99=303, 99.9=649, 99.99=6359] 
2026-05-02 18:28:34:444 20 sec: 932971 operations; 47468.2 current ops/sec; est completion in 2 second [INSERT: Count=474633, Max=7967, Min=56, Avg=165.84, 90=179, 99=291, 99.9=409, 99.99=753] 
2026-05-02 18:28:35:984 21 sec: 1000000 operations; 43525.32 current ops/sec; [CLEANUP: Count=8, Max=2569, Min=2, Avg=324, 90=10, 99=2569, 99.9=2569, 99.99=2569] [INSERT: Count=66983, Max=7207, Min=59, Avg=159.41, 90=172, 99=249, 99.9=351, 99.99=6775] 
[OVERALL], RunTime(ms), 21540
[OVERALL], Throughput(ops/sec), 46425.25533890436
[TOTAL_GCS_G1_Young_Generation], Count, 13
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 73
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.33890436397400187
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 13
[TOTAL_GC_TIME], Time(ms), 73
[TOTAL_GC_TIME_%], Time(%), 0.33890436397400187
[CLEANUP], Operations, 8
[CLEANUP], AverageLatency(us), 324.0
[CLEANUP], MinLatency(us), 2
[CLEANUP], MaxLatency(us), 2569
[CLEANUP], 95thPercentileLatency(us), 2569
[CLEANUP], 99thPercentileLatency(us), 2569
[INSERT], Operations, 1000000
[INSERT], AverageLatency(us), 165.71399
[INSERT], MinLatency(us), 52
[INSERT], MaxLatency(us), 123007
[INSERT], 95thPercentileLatency(us), 191
[INSERT], 99thPercentileLatency(us), 297
[INSERT], Return=OK, 1000000