results/mongodb/workloadc_load.log
java -cp /local/build/ycsb/mongodb-binding/conf:/local/build/ycsb/conf:/local/build/ycsb/lib/core-0.17.0.jar:/local/build/ycsb/lib/HdrHistogram-2.1.4.jar:/local/build/ycsb/lib/jackson-mapper-asl-1.9.4.jar:/local/build/ycsb/lib/htrace-core4-4.1.0-incubating.jar:/local/build/ycsb/lib/jackson-core-asl-1.9.4.jar:/local/build/ycsb/mongodb-binding/lib/snappy-java-1.1.7.1.jar:/local/build/ycsb/mongodb-binding/lib/logback-classic-1.1.2.jar:/local/build/ycsb/mongodb-binding/lib/mongo-java-driver-3.8.0.jar:/local/build/ycsb/mongodb-binding/lib/slf4j-api-1.7.25.jar:/local/build/ycsb/mongodb-binding/lib/mongodb-binding-0.17.0.jar:/local/build/ycsb/mongodb-binding/lib/logback-core-1.1.2.jar:/local/build/ycsb/mongodb-binding/lib/mongodb-async-driver-2.0.1.jar site.ycsb.Client -db site.ycsb.db.MongoDbClient -s -P /local/build/ycsb/workloads/workloadc -p recordcount=1000000 -p operationcount=500000 -p mongodb.url=mongodb://127.0.0.1:27099/ycsb -threads 8 -load
Command line: -db site.ycsb.db.MongoDbClient -s -P /local/build/ycsb/workloads/workloadc -p recordcount=1000000 -p operationcount=500000 -p mongodb.url=mongodb://127.0.0.1:27099/ycsb -threads 8 -load
YCSB Client 0.17.0

Loading workload...
Starting test.
2026-05-02 18:29:31:855 0 sec: 0 operations; est completion in 0 second 
mongo client connection created with mongodb://127.0.0.1:27099/ycsb
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
[...]
2026-05-02 18:29:41:796 10 sec: 297305 operations; 29730.5 current ops/sec; est completion in 24 seconds [INSERT: Count=297368, Max=1241087, Min=54, Avg=254.98, 90=193, 99=345, 99.9=972, 99.99=247807] 
2026-05-02 18:29:51:796 20 sec: 685541 operations; 38823.6 current ops/sec; est completion in 10 seconds [INSERT: Count=388212, Max=308479, Min=57, Avg=203.27, 90=176, 99=300, 99.9=793, 99.99=138879] 
2026-05-02 18:29:58:923 27 sec: 1000000 operations; 44122.21 current ops/sec; [CLEANUP: Count=8, Max=2563, Min=2, Avg=323.5, 90=9, 99=2563, 99.9=2563, 99.99=2563] [INSERT: Count=314420, Max=324607, Min=53, Avg=170.34, 90=178, 99=289, 99.9=391, 99.99=2003] 
[OVERALL], RunTime(ms), 27127
[OVERALL], Throughput(ops/sec), 36863.64139049655
[TOTAL_GCS_G1_Young_Generation], Count, 13
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 70
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.2580454897334759
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 13
[TOTAL_GC_TIME], Time(ms), 70
[TOTAL_GC_TIME_%], Time(%), 0.2580454897334759
[CLEANUP], Operations, 8
[CLEANUP], AverageLatency(us), 323.5
[CLEANUP], MinLatency(us), 2
[CLEANUP], MaxLatency(us), 2563
[CLEANUP], 95thPercentileLatency(us), 2563
[CLEANUP], 99thPercentileLatency(us), 2563
[INSERT], Operations, 1000000
[INSERT], AverageLatency(us), 208.294164
[INSERT], MinLatency(us), 53
[INSERT], MaxLatency(us), 1241087
[INSERT], 95thPercentileLatency(us), 196
[INSERT], 99thPercentileLatency(us), 307
[INSERT], Return=OK, 1000000