results/mongodb/workloadf_load.log
java -cp /local/build/ycsb/mongodb-binding/conf:/local/build/ycsb/conf:/local/build/ycsb/lib/core-0.17.0.jar:/local/build/ycsb/lib/HdrHistogram-2.1.4.jar:/local/build/ycsb/lib/jackson-mapper-asl-1.9.4.jar:/local/build/ycsb/lib/htrace-core4-4.1.0-incubating.jar:/local/build/ycsb/lib/jackson-core-asl-1.9.4.jar:/local/build/ycsb/mongodb-binding/lib/snappy-java-1.1.7.1.jar:/local/build/ycsb/mongodb-binding/lib/logback-classic-1.1.2.jar:/local/build/ycsb/mongodb-binding/lib/mongo-java-driver-3.8.0.jar:/local/build/ycsb/mongodb-binding/lib/slf4j-api-1.7.25.jar:/local/build/ycsb/mongodb-binding/lib/mongodb-binding-0.17.0.jar:/local/build/ycsb/mongodb-binding/lib/logback-core-1.1.2.jar:/local/build/ycsb/mongodb-binding/lib/mongodb-async-driver-2.0.1.jar site.ycsb.Client -db site.ycsb.db.MongoDbClient -s -P /local/build/ycsb/workloads/workloadf -p recordcount=1000000 -p operationcount=500000 -p mongodb.url=mongodb://127.0.0.1:27099/ycsb -threads 8 -load
Command line: -db site.ycsb.db.MongoDbClient -s -P /local/build/ycsb/workloads/workloadf -p recordcount=1000000 -p operationcount=500000 -p mongodb.url=mongodb://127.0.0.1:27099/ycsb -threads 8 -load
YCSB Client 0.17.0

Loading workload...
Starting test.
2026-05-02 18:30:12:874 0 sec: 0 operations; est completion in 0 second 
mongo client connection created with mongodb://127.0.0.1:27099/ycsb
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
[...]
2026-05-02 18:30:22:814 10 sec: 415004 operations; 41500.4 current ops/sec; est completion in 15 seconds [INSERT: Count=415069, Max=219647, Min=59, Avg=181.95, 90=189, 99=326, 99.9=791, 99.99=7039] 
2026-05-02 18:30:32:814 20 sec: 899687 operations; 48468.3 current ops/sec; est completion in 3 second [INSERT: Count=484656, Max=7547, Min=53, Avg=162.49, 90=174, 99=265, 99.9=341, 99.99=680] 
2026-05-02 18:30:35:252 22 sec: 1000000 operations; 41128.74 current ops/sec; [CLEANUP: Count=8, Max=2575, Min=1, Avg=324.88, 90=10, 99=2575, 99.9=2575, 99.99=2575] [INSERT: Count=100275, Max=6651, Min=53, Avg=166.1, 90=176, 99=290, 99.9=374, 99.99=662] 
[OVERALL], RunTime(ms), 22439
[OVERALL], Throughput(ops/sec), 44565.265831810684
[TOTAL_GCS_G1_Young_Generation], Count, 13
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 76
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.3386960203217612
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 13
[TOTAL_GC_TIME], Time(ms), 76
[TOTAL_GC_TIME_%], Time(%), 0.3386960203217612
[CLEANUP], Operations, 8
[CLEANUP], AverageLatency(us), 324.875
[CLEANUP], MinLatency(us), 1
[CLEANUP], MaxLatency(us), 2575
[CLEANUP], 95thPercentileLatency(us), 2575
[CLEANUP], 99thPercentileLatency(us), 2575
[INSERT], Operations, 1000000
[INSERT], AverageLatency(us), 170.929226
[INSERT], MinLatency(us), 53
[INSERT], MaxLatency(us), 219647
[INSERT], 95thPercentileLatency(us), 193
[INSERT], 99thPercentileLatency(us), 304
[INSERT], Return=OK, 1000000